/*Створити масив, довжину та елементи якого задає користувач.
Відсортувати масив за зростанням.
Видалити елементи з масиву з 2 по 4 (включно!).
У міру змін виводити вміст масиву на сторінку.*/
// масив 
let n=prompt('Кількість елементів массива',5)
if(n === null) { 
   console.log('Відміна');
} else if (n==='') { 
   console.log('Ви не ввели кількість елементів');
} else if (n==0) {
   console.log('Нема тіла масива');
} else {

let a = []; 
for (let i=0; i<n; i++) {
   a [i] = prompt('Введіть eлемент масиву');
      if(a [i] === null) { //просто попередження
         console.log('Відміна вводу');
      } else if (a [i] === '') { //просто попередження
         console.log('Пустий елемент');
      } 
}
   console.log(a);
   console.log (a.sort((a,b)=>a-b));// сортування масиву
   console.log (a.splice(1,3));//видалення елементів
   console.log(a);//залишилося після видалення
}




