//Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
/*let a=[];
for (let i=20; i<=30; i=i+0.5) {
   a.push(i);
}
console.log (a.join(' '));*/

//Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
/*let a=[];
for (let i=10; i<=100; i=i+10) {
   a.push(`${i} доларів= ${27*i} гривень`);
}
console.log(a.join("\n"));*/

//Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
/*let n=1000; //namber 
let a=[];
for (let i=1; i<=100; i++) {
   if ((i**2)<=n) {
      a.push(i);
   } else {
      break;
   }
}
   console.log (a.join(" "));*/

//Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

/*let a=54;
let b=[]; 
for (let i=1; i<=a; i++) {
   if (a%i===0) {
      b.push(i);
   } else {
      b.push();
   }
}
if (b.length>2) {
      console.log (`Число ${a} не просте`);
   } else {
      console.log (`Число ${a} просте`);
   }
console.log (b.join(' '));*/

//Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
/*let a=81;
let b=[];
for (let i=1; i<=a; i++) {
   if (a===3**i ) {
      b.push(`${a} = 3 в  ${i} ступені`);
   } else {
      b.push();
   }
}
if (b.length>0) {
      console.log (`Число ${a} можливо отримати`)
   } else {
      console.log (`Число ${a} не можливо отримати`)
   }
console.log (b.join(' '));*/
